[{"_id":{"$oid":"68fb2339f1debad0a859271c"},"job_id":"1761289016915","title":"Softwaree engineer intern","description":"If you are a curious and creative software developer and are keen to take on challenges and responsibilities, we would love to have you with us!\n\nAccelerate your career as an Odoo Software Developer by joining us, wherein we offer internship opportunities with great Open Source Projects where your work will count.\n","requirements":"You develop the product itself and therefore the apps in it. No matter if you joined a short or long time ago, intern or employee, we'll ask your opinion on creations and improvements ideas.\nOdoo is Open Source so you write public code and contribute to the\ndevelopment community. Great, isn't it? Moreover what you develop will be used by millions of people all over the world. You have the chance to see the impact of your work and make a real contribution to the success of the company.\n\n It offers you so many opportunities : you can be an app dev, a framework dev, work in security, develop a SaaS (odooSH), do DevOps/infrastructure management, work on our internal tools, analyze and improve performance, etc. What's really cool? You can switch from one to the other whenever you decide it's time for a new challenge, so you gain a lot of experience in multiple fields in a short time. \n\nThe R&D team counts more than 150 developers split in ~15 teams. After 3 weeks of initial training, we'll present you all of them and you'll choose the one you prefer.\nProgramming Languages: Python & Javascript\nDatabase: PostgreSQL (with object relational mapping)\nCollaboration platform: GitHub\nDevelopment model: open with external community\nFramework: Odoo (ORM, Workflows, Report Engine, BI, AI)","last_date":{"$date":"2025-10-30T00:00:00Z"},"company_id":"68fa8a4cf1debad0a85900c3","salary":"20000","location":{"address":"Gujrat, Gujrat Tehsil, Gujrat District, Gujrat Division, Punjab, Pakistan","coordinates":{"lat":32.5686782,"lng":74.071481},"placeId":"osm_198527253"},"job_type":"Internship","experience_level":"Entry Level","work_location":"Office","application_link":"https://www.odoo.com/jobs/software-developer-intern-2000000month-stipend-685?utm_campaign=Job+Campaign&utm_medium=Website&utm_source=IndeedSponsor","isActive":true,"createdAt":{"$date":"2025-10-24T06:56:57.051Z"},"updatedAt":{"$date":"2025-10-27T15:27:50.805Z"},"__v":0,"applicantsCount":6}]
